config/config.org
* Load lightning modules
#+BEGIN_SRC emacs-lisp
  (lightning-load-module "package-manager")
  (lightning-load-module "make-no-insert-keymap")
  (lightning-load-module "modal")
  (lightning-load-module "sensible-defaults")
#+END_SRC
* General customiztions
Set username
#+BEGIN_SRC emacs-lisp
  (setq lightning-user-name "AnXPyDev")
#+END_SRC
Enable electric-pair mode
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode 1)
#+END_SRC
Enable line numbers
#+BEGIN_SRC emacs-lisp
  (global-linum-mode 1)
  (setq linum-format " %3d ")
#+END_SRC
Enable text wrapping (visual lines)
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode 1)
#+END_SRC
Setup indent width (and use spaces instead of tabs)
#+BEGIN_SRC emacs-lisp
  (setq lightning-user-indent-offset 2)
  (setq lightning-user-indent-use-spaces t)
#+END_SRC
Set scroll step to 1 for smoother scrolling
#+BEGIN_SRC emacs-lisp
  (setq-default scroll-step 1)
#+END_SRC
Automatically revert buffers and disable revert messages
#+BEGIN_SRC emacs-lisp
  (setq auto-revert-verbose nil)
  (global-auto-revert-mode)
#+END_SRC
Cursor settings
#+BEGIN_SRC emacs-lisp
  (setq lightning-user-default-cursor-type 'hbar)
  (blink-cursor-mode 0)
#+END_SRC
Apply lightning variables
#+BEGIN_SRC emacs-lisp
  (lightning-apply-user-variables)
#+END_SRC
* Packages
** general
#+BEGIN_SRC emacs-lisp
  (lightning-pkg general :require t)
#+END_SRC
** which-key
#+BEGIN_SRC emacs-lisp
  (lightning-pkg which-key :require t)
  (which-key-mode 1)
#+END_SRC
** swiper
#+BEGIN_SRC emacs-lisp
  (lightning-pkg swiper :require t)
#+END_SRC
** company
#+BEGIN_SRC emacs-lisp
  (lightning-pkg company :require t)
#+END_SRC
** projectile
#+BEGIN_SRC emacs-lisp
  (lightning-pkg projectile :require t)
  (projectile-global-mode 1)
#+END_SRC
** ivy
#+BEGIN_SRC emacs-lisp
  (lightning-pkg ivy :require t)
  (ivy-mode 1)
#+END_SRC
** highlight parentheses
#+BEGIN_SRC emacs-lisp
  (lightning-pkg highlight-parentheses :require t)
  (global-highlight-parentheses-mode)
#+END_SRC
** dashboard
#+BEGIN_SRC emacs-lisp
  (lightning-pkg dashboard :require t)
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner (concat lightning-config-directory "banner.png"))
  (setq dashboard-items '((recents . 5)
        (projects . 5)))
  (setq dashboard-banner-logo-title "Welcome to Emacs.")
#+END_SRC
** minor-mode-hack
#+BEGIN_SRC emacs-lisp
  (lightning-pkg minor-mode-hack :require t)
#+END_SRC
** avy
#+BEGIN_SRC emacs-lisp
  (lightning-pkg avy :require t)
#+END_SRC
** elmacro
#+BEGIN_SRC emacs-lisp
  (lightning-pkg elmacro :require t)
  (elmacro-mode 1)
#+END_SRC
** undo-tree
#+BEGIN_SRC emacs-lisp
  (lightning-pkg undo-tree :require t)
  (global-undo-tree-mode)
#+END_SRC
** expand-region
#+BEGIN_SRC emacs-lisp
  (lightning-pkg expand-region :require t)
#+END_SRC
** multiple-cursors
#+BEGIN_SRC emacs-lisp
  (lightning-pkg multiple-cursors :require t)
#+END_SRC
** flycheck
#+BEGIN_SRC emacs-lisp
  (lightning-pkg flycheck :require t)
  (global-flycheck-mode t)
#+END_SRC
Disable overlay and change fringe shape
#+BEGIN_SRC emacs-lisp
  (define-fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    (vector #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000))

  (flycheck-define-error-level 'error
    ;;:overlay-category 'flycheck-error-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-error
    :error-list-face 'flycheck-error-list-error)

  (flycheck-define-error-level 'warning
    ;;:overlay-category 'flycheck-warning-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-warning
    :error-list-face 'flycheck-error-list-warning)

  (flycheck-define-error-level 'info
    ;;:overlay-category 'flycheck-info-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-info
    :error-list-face 'flycheck-error-list-info)
#+END_SRC
Disable minibuffer messages about errors
#+BEGIN_SRC emacs-lisp
  (setq flycheck-display-errors-function nil)
#+END_SRC
** origami
#+BEGIN_SRC emacs-lisp
  (lightning-pkg origami :require t)
  (global-origami-mode t)
#+END_SRC
** hlinum
#+BEGIN_SRC emacs-lisp
  (lightning-pkg hlinum :require t)
#+END_SRC
** themes
#+BEGIN_SRC emacs-lisp
  (lightning-pkg kaolin-themes)
  (lightning-pkg arc-dark-theme)
#+END_SRC
* Programming Languages
** Python
#+BEGIN_SRC emacs-lisp
  (setq-default python-indent-offset lightning-user-indent-offset)
#+END_SRC
** Lua
Lua mode
#+BEGIN_SRC emacs-lisp
  (lightning-pkg lua-mode :require t)
#+END_SRC
Lua mode for company
#+BEGIN_SRC emacs-lisp
  (lightning-pkg company-lua :require t)
  (eval-after-load 'company
    '(add-to-list 'company-backends 'company-lua))
#+END_SRC
Set Lua indentation width
#+BEGIN_SRC emacs-lisp
  (setq lua-indent-level tab-width)
#+END_SRC
Fix for broken lua-mode indentation
#+BEGIN_SRC emacs-lisp
  (defun lua-calculate-modifier (modifier)
    (if (= modifier 0)
        0
      lua-indent-level))

  (defun lua-calculate-indentation (&optional parse-start)
    (save-excursion
      (let ((continuing-p (lua-is-continuing-statement-p))
            (cur-line-begin-pos (line-beginning-position)))
        (or
         (lua-calculate-indentation-override)

         (when (lua-forward-line-skip-blanks 'back)
           (let* ((modifier
                   (lua-calculate-indentation-block-modifier cur-line-begin-pos)))
             (+ (current-indentation) (lua-calculate-modifier modifier))))
         0))))

  (defun lua-calculate-indentation-override (&optional parse-start)
    "Return overriding indentation amount for special cases.
  Look for an uninterrupted sequence of block-closing tokens that starts
  at the beginning of the line. For each of these tokens, shift indentation
  to the left by the amount specified in lua-indent-level."
    (let ((indentation-modifier 0)
          (case-fold-search nil)
          (block-token nil))
      (save-excursion
        (if parse-start (goto-char parse-start))
        ;; Look for the last block closing token
        (back-to-indentation)
        (if (and (not (lua-comment-or-string-p))
                 (looking-at lua-indentation-modifier-regexp)
                 (let ((token-info (lua-get-block-token-info (match-string 0))))
                   (and token-info
                        (not (eq 'open (lua-get-token-type token-info))))))
            (when (lua-goto-matching-block-token nil nil 'backward)
              ;; Exception cases: when the start of the line is an assignment,
              ;; go to the start of the assignment instead of the matching item
              (let ((block-start-column (current-column))
                    (block-start-point (point)))
                (if (lua-point-is-after-left-shifter-p)
                    (current-indentation)
                  block-start-column)))))))

  (defun lua-calculate-indentation-override (&optional parse-start)
    "Return overriding indentation amount for special cases.
  Look for an uninterrupted sequence of block-closing tokens that starts
  at the beginning of the line. For each of these tokens, shift indentation
  to the left by the amount specified in lua-indent-level."
    (let ((indentation-modifier 0)
          (case-fold-search nil)
          (block-token nil))
      (save-excursion
        (if parse-start (goto-char parse-start))
        ;; Look for the last block closing token
        (back-to-indentation)
        (if (and (not (lua-comment-or-string-p))
                 (looking-at lua-indentation-modifier-regexp)
                 (let ((token-info (lua-get-block-token-info (match-string 0))))
                   (and token-info
                        (not (eq 'open (lua-get-token-type token-info))))))
            (when (lua-goto-matching-block-token)
              ;; Exception cases: when the start of the line is an assignment,
              ;; go to the start of the assignment instead of the matching item
              (let ((block-start-column (current-column))
                    (block-start-point (point)))
                (if (lua-point-is-after-left-shifter-p)
                    (current-indentation)
                  (current-indentation))))))))

#+END_SRC
** MoonScript
Install moonscript mode
#+BEGIN_SRC emacs-lisp
  (lightning-pkg moonscript :require t)
#+END_SRC
