config/config.el
(lightning-load-module "package-manager")
(lightning-load-module "make-no-insert-keymap")
(lightning-load-module "modal")
(lightning-load-module "sensible-defaults")

(setq lightning-user-name "AnXPyDev")

(electric-pair-mode 1)

(global-linum-mode 1)
(setq linum-format " %3d ")

(global-visual-line-mode 1)

(setq lightning-user-indent-offset 2)
(setq lightning-user-indent-use-spaces t)

(setq-default scroll-step 1)

(setq auto-revert-verbose nil)
(global-auto-revert-mode)

(setq lightning-user-default-cursor-type 'hbar)
(blink-cursor-mode 0)

(lightning-apply-user-variables)

(lightning-pkg general :require t)

(lightning-pkg which-key :require t)
(which-key-mode 1)

(lightning-pkg swiper :require t)

(lightning-pkg company :require t)

(lightning-pkg projectile :require t)
(projectile-global-mode 1)

(lightning-pkg ivy :require t)
(ivy-mode 1)

(lightning-pkg highlight-parentheses :require t)
(global-highlight-parentheses-mode)

(lightning-pkg dashboard :require t)
(dashboard-setup-startup-hook)
(setq dashboard-startup-banner (concat lightning-config-directory "banner.png"))
(setq dashboard-items '((recents . 5)
      (projects . 5)))
(setq dashboard-banner-logo-title "Welcome to Emacs.")

(lightning-pkg minor-mode-hack :require t)

(lightning-pkg avy :require t)

(lightning-pkg elmacro :require t)
(elmacro-mode 1)

(lightning-pkg undo-tree :require t)
(global-undo-tree-mode)

(lightning-pkg expand-region :require t)

(lightning-pkg multiple-cursors :require t)

(lightning-pkg flycheck :require t)
(global-flycheck-mode t)

(define-fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  (vector #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000))

(flycheck-define-error-level 'error
  ;;:overlay-category 'flycheck-error-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-error
  :error-list-face 'flycheck-error-list-error)

(flycheck-define-error-level 'warning
  ;;:overlay-category 'flycheck-warning-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-warning
  :error-list-face 'flycheck-error-list-warning)

(flycheck-define-error-level 'info
  ;;:overlay-category 'flycheck-info-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-info
  :error-list-face 'flycheck-error-list-info)

(setq flycheck-display-errors-function nil)

(lightning-pkg origami :require t)
(global-origami-mode t)

(lightning-pkg hlinum :require t)

(lightning-pkg kaolin-themes)
(lightning-pkg arc-dark-theme)

(setq-default python-indent-offset lightning-user-indent-offset)

(lightning-pkg lua-mode :require t)

(lightning-pkg company-lua :require t)
(eval-after-load 'company
  '(add-to-list 'company-backends 'company-lua))

(setq lua-indent-level tab-width)

(defun lua-calculate-modifier (modifier)
  (if (= modifier 0)
      0
    lua-indent-level))

(defun lua-calculate-indentation (&optional parse-start)
  (save-excursion
    (let ((continuing-p (lua-is-continuing-statement-p))
          (cur-line-begin-pos (line-beginning-position)))
      (or
       (lua-calculate-indentation-override)

       (when (lua-forward-line-skip-blanks 'back)
         (let* ((modifier
                 (lua-calculate-indentation-block-modifier cur-line-begin-pos)))
           (+ (current-indentation) (lua-calculate-modifier modifier))))
       0))))

(defun lua-calculate-indentation-override (&optional parse-start)
  "Return overriding indentation amount for special cases.
Look for an uninterrupted sequence of block-closing tokens that starts
at the beginning of the line. For each of these tokens, shift indentation
to the left by the amount specified in lua-indent-level."
  (let ((indentation-modifier 0)
        (case-fold-search nil)
        (block-token nil))
    (save-excursion
      (if parse-start (goto-char parse-start))
      ;; Look for the last block closing token
      (back-to-indentation)
      (if (and (not (lua-comment-or-string-p))
               (looking-at lua-indentation-modifier-regexp)
               (let ((token-info (lua-get-block-token-info (match-string 0))))
                 (and token-info
                      (not (eq 'open (lua-get-token-type token-info))))))
          (when (lua-goto-matching-block-token nil nil 'backward)
            ;; Exception cases: when the start of the line is an assignment,
            ;; go to the start of the assignment instead of the matching item
            (let ((block-start-column (current-column))
                  (block-start-point (point)))
              (if (lua-point-is-after-left-shifter-p)
                  (current-indentation)
                block-start-column)))))))

(defun lua-calculate-indentation-override (&optional parse-start)
  "Return overriding indentation amount for special cases.
Look for an uninterrupted sequence of block-closing tokens that starts
at the beginning of the line. For each of these tokens, shift indentation
to the left by the amount specified in lua-indent-level."
  (let ((indentation-modifier 0)
        (case-fold-search nil)
        (block-token nil))
    (save-excursion
      (if parse-start (goto-char parse-start))
      ;; Look for the last block closing token
      (back-to-indentation)
      (if (and (not (lua-comment-or-string-p))
               (looking-at lua-indentation-modifier-regexp)
               (let ((token-info (lua-get-block-token-info (match-string 0))))
                 (and token-info
                      (not (eq 'open (lua-get-token-type token-info))))))
          (when (lua-goto-matching-block-token)
            ;; Exception cases: when the start of the line is an assignment,
            ;; go to the start of the assignment instead of the matching item
            (let ((block-start-column (current-column))
                  (block-start-point (point)))
              (if (lua-point-is-after-left-shifter-p)
                  (current-indentation)
                (current-indentation))))))))

(lightning-pkg moonscript :require t)
