config/config.org
** C/C++
Install irony, a c/c++ completion package
#+BEGIN_SRC emacs-lisp
  (lightning-pkg irony :require t)
  (lightning-pkg company-irony :require t)
  (lightning-pkg company-c-headers :require t)
#+END_SRC
Adds hooks to both c and c++ mode
#+BEGIN_SRC emacs-lisp
  (defun lang-c/add-hook (func-name)
    (add-hook 'c++-mode-hook func-name)
    (add-hook 'c-mode-hook func-name))
#+END_SRC
Initialize irony if current system isn't windows
#+BEGIN_SRC emacs-lisp
  (when (not (string-equal system-type "windows-nt"))
    (lang-c/add-hook 'irony-mode))
#+END_SRC
Use gcc flycheck checker instead of clang
#+BEGIN_SRC emacs-lisp
  (defun lang-c/change-checker()
    (add-to-list 'flycheck-disabled-checkers 'c/c++-clang)
    (add-to-list 'flycheck-enabled-checkers 'c/c++-gcc)
    (delete 'c/c++-clang flycheck-enabled-checkers))

  (lang-c/add-hook 'lang-c/change-checker)
#+END_SRC
** Shell Script
#+BEGIN_SRC emacs-lisp
  (setq-default sh-basic-offset tab-width)
#+END_SRC
** D
Install d mode package
#+BEGIN_SRC emacs-lisp
  (lightning-pkg d-mode :require t)
#+END_SRC
* Keybindings
** make-normal-sparse-keymap

Returns a keymap, where all the self-inserting characters are ignored
#+BEGIN_SRC emacs-lisp
  (setq self-inserting-characters '("`" "1" "2" "3" "4" "5" "6" "7" "8" "9" "0" "-" "=" "q" "w" "e" "r" "t" "y" "u" "i" "o" "p" "[" "]" "a" "s" "d" "f" "g" "h" "j" "k" "l" ";" "'" "\\" "z" "x" "c" "v" "b" "n" "m" "," "." "/" "TAB" "SPC" "<tab>" "<space>" "~" "@" "#" "$" "%" "^" "&" "*" "(" ")" "_" "+" "Q" "W" "E" "R" "T" "Y" "U" "I" "O" "P" "{" "}" "A" "S" "D" "F" "G" "H" "J" "K" "L" ":" "\"" "|" ">" "Z" "X" "C" "V" "B" "N" "M" "<" ">" "?" "DEL"))

  (defun make-normal-sparse-keymap()
    (setq result (make-sparse-keymap))
    (dolist (char self-inserting-characters)
      (define-key result (kbd char) 'ignore))
    result)
#+END_SRC
** Leader
#+BEGIN_SRC emacs-lisp
  (setq leader-map (make-sparse-keymap))

  (general-define-key
   :keymaps 'leader-map
    "SPC" 'execute-extended-command
    "s" 'save-some-buffers
    "b" 'ivy-switch-buffer
    "f" 'find-file
    "d" 'dired
    "k" 'kill-buffer
    "RET" 'eshell/toggle
    "<return>" 'eshell/toggle
    "C-RET" 'eshell/new
    "C-<return>" 'eshell/new
    "e b" 'eval-buffer
    "e r" 'eval-region
    "e e" 'eval-expression)
#+END_SRC
** Globals
#+BEGIN_SRC emacs-lisp
  (general-define-key
   "C-z" nil
   "C-SPC" leader-map
   "C-@" leader-map
   "<escape>" (kbd "C-g")
   "M-q" (lambda() (interactive) (lightning-modal-raise-default-mode))
   "M-e" (lambda() (interactive) (lightning-modal-disable-all-modes)))
#+END_SRC
** normal bare map
Used as a base for other maps
#+BEGIN_SRC emacs-lisp
  (setq modal/normal-bare-map (make-sparse-keymap))

  (general-define-key
   :keymaps 'modal/normal-bare-map
   "k" 'previous-line
   "K" 'scroll-down-command
   "j" 'next-line
   "J" 'scroll-up-command
   "h" 'backward-char
   "H" 'backward-word
   "l" 'forward-char
   "L" 'forward-word
   "a" 'beginning-of-line
   "f" 'end-of-line
   "SPC" leader-map)
#+END_SRC
** normal-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/normal-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

  (general-define-key
   :keymaps 'modal/normal-map
   "q" (lambda() (interactive) (lightning-modal-raise-mode insert))
   "Q" 'edit/insert-beginning-of-line
   "r" 'edit/insert-after
   "R" 'edit/insert-end-of-line
   "e" 'edit/set-region
   "E" 'edit/set-region-line
   "s" 'edit/copy-whole-line
   "S" 'edit/copy-whole-line
   "d" (kbd "C-d")
   "D" 'kill-whole-line
   "w" 'yank
   "W" 'edit/yank-line
   "/" 'swiper
   "u" 'undo-tree-undo
   "U" 'undo-tree-redo
   "n" 'edit/open-line
   "N" (lambda() (interactive) (edit/open-line) (lightning-modal-raise-mode insert))
   "p" 'edit/open-line-above
   "P" (lambda() (interactive) (edit/open-line-above) (lightning-modal-raise-mode insert))
   "g" nil
   "g l" 'isearch-forward
   "g h" 'isearch-backward
   "g c" 'avy-goto-char
   "g l" 'avy-goto-line
   "m" 'edit/insert-mark
   "M" 'edit/goto-mark
   "TAB" 'origami-toggle-node
   "<tab>" 'origami-toggle-node)
#+END_SRC
** region-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/region-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

  (general-define-key
   :keymaps 'modal/region-map
   "t" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (lightning-modal-raise-mode insert))
   "s" (lambda() (interactive) (copy-region-as-kill (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
   "d" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
   "w" 'edit/yank-region
   "C-g" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
   "M-q" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
   "<escape>" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
   "e" 'er/expand-region
   "TAB" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
   "<tab>" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
   "g" nil
   "g l" 'isearch-forward
   "g h" 'isearch-backward
   ";" 'comment-or-uncomment-region
   "o" nil
   "o (" (lambda() (interactive) (edit/surround-region "(" ")") (lightning-modal-raise-default-mode))
   "o o" (lambda() (interactive) (edit/surround-region (read-from-minibuffer "left: ") (read-from-minibuffer "right: ")) (lightning-modal-raise-default-mode))
   "o )" (lambda() (interactive) (edit/surround-region "(" ")") (lightning-modal-raise-default-mode))
   "o {" (lambda() (interactive) (edit/surround-region "{" "}") (lightning-modal-raise-default-mode))
   "o }" (lambda() (interactive) (edit/surround-region "{" "}") (lightning-modal-raise-default-mode))
   "o [" (lambda() (interactive) (edit/surround-region "[" "]") (lightning-modal-raise-default-mode))
   "o ]" (lambda() (interactive) (edit/surround-region "[" "]") (lightning-modal-raise-default-mode))
   "o \"" (lambda() (interactive) (edit/surround-region "\"" "\"") (lightning-modal-raise-default-mode))
   "o <" (lambda() (interactive) (edit/surround-region "<" ">") (lightning-modal-raise-default-mode))
   "o '" (lambda() (interactive) (edit/surround-region "'" "'") (lightning-modal-raise-default-mode)))
#+END_SRC
** insert-mode map
This is the same as emacs-map
#+BEGIN_SRC emacs-lisp
  (setq modal/insert-map (make-sparse-keymap))

  (general-define-key
   :keymaps 'modal/insert-map
   "C-g" (lambda() (interactive) (lightning-modal-raise-default-mode)))
#+END_SRC
** company-active-map
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :keymaps 'company-active-map
   "<tab>" 'company-complete
   "TAB" 'company-complete)
#+END_SRC
** eshell map
#+BEGIN_SRC emacs-lisp
  (defun set-eshell-custom-map()
    (general-define-key
      :keymaps 'eshell-mode-map
      "C-SPC" leader-map
      "C-@" leader-map))

  (add-hook 'eshell-mode-hook 'set-eshell-custom-map)
#+END_SRC
** dired-mode map
#+BEGIN_SRC emacs-lisp
  (require 'dired)
  (setq dired-mode-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) dired-mode-map))

  (general-define-key
   :keymaps 'dired-mode-map
   "q" (lambda() (interactive) (wdired-change-to-wdired-mode) (lightning-modal-raise-default-mode)))
#+END_SRC
** wdired-normal-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/wdired-normal-map (copy-keymap modal/normal-map))

  (general-define-key
   :keymaps 'modal/wdired-normal-map
   "SPC s" (lambda() (interactive) (wdired-finish-edit) (lightning-modal-raise-default-mode)))
#+END_SRC
** org-normal-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/org-normal-map (copy-keymap modal/normal-map))

  (general-define-key
   :keymaps 'modal/org-normal-map
   "TAB" 'org-cycle
   "<tab>" 'org-cycle)
#+END_SRC
** ivy minibuffer map
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :keymaps 'ivy-minibuffer-map
   "M-j" 'ivy-next-line
   "M-k" 'ivy-previous-line
   "M-RET" 'ivy-immediate-done
   "TAB" 'ivy-partial-or-done
   "RET" 'ivy-done)
#+END_SRC
* Modal
This is a custom implementation of modal editing, similiar to vim's, including normal, insert, and region mode
