config/config.el

(lightning-pkg irony :require t)
(lightning-pkg company-irony :require t)
(lightning-pkg company-c-headers :require t)

(defun lang-c/add-hook (func-name)
  (add-hook 'c++-mode-hook func-name)
  (add-hook 'c-mode-hook func-name))

(when (not (string-equal system-type "windows-nt"))
  (lang-c/add-hook 'irony-mode))

(defun lang-c/change-checker()
  (add-to-list 'flycheck-disabled-checkers 'c/c++-clang)
  (add-to-list 'flycheck-enabled-checkers 'c/c++-gcc)
  (delete 'c/c++-clang flycheck-enabled-checkers))

(lang-c/add-hook 'lang-c/change-checker)

(setq-default sh-basic-offset tab-width)

(lightning-pkg d-mode :require t)

(setq self-inserting-characters '("`" "1" "2" "3" "4" "5" "6" "7" "8" "9" "0" "-" "=" "q" "w" "e" "r" "t" "y" "u" "i" "o" "p" "[" "]" "a" "s" "d" "f" "g" "h" "j" "k" "l" ";" "'" "\\" "z" "x" "c" "v" "b" "n" "m" "," "." "/" "TAB" "SPC" "<tab>" "<space>" "~" "@" "#" "$" "%" "^" "&" "*" "(" ")" "_" "+" "Q" "W" "E" "R" "T" "Y" "U" "I" "O" "P" "{" "}" "A" "S" "D" "F" "G" "H" "J" "K" "L" ":" "\"" "|" ">" "Z" "X" "C" "V" "B" "N" "M" "<" ">" "?" "DEL"))

(defun make-normal-sparse-keymap()
  (setq result (make-sparse-keymap))
  (dolist (char self-inserting-characters)
    (define-key result (kbd char) 'ignore))
  result)

(setq leader-map (make-sparse-keymap))

(general-define-key
 :keymaps 'leader-map
  "SPC" 'execute-extended-command
  "s" 'save-some-buffers
  "b" 'ivy-switch-buffer
  "f" 'find-file
  "d" 'dired
  "k" 'kill-buffer
  "RET" 'eshell/toggle
  "<return>" 'eshell/toggle
  "C-RET" 'eshell/new
  "C-<return>" 'eshell/new
  "e b" 'eval-buffer
  "e r" 'eval-region
  "e e" 'eval-expression)

(general-define-key
 "C-z" nil
 "C-SPC" leader-map
 "C-@" leader-map
 "<escape>" (kbd "C-g")
 "M-q" (lambda() (interactive) (lightning-modal-raise-default-mode))
 "M-e" (lambda() (interactive) (lightning-modal-disable-all-modes)))

(setq modal/normal-bare-map (make-sparse-keymap))

(general-define-key
 :keymaps 'modal/normal-bare-map
 "k" 'previous-line
 "K" 'scroll-down-command
 "j" 'next-line
 "J" 'scroll-up-command
 "h" 'backward-char
 "H" 'backward-word
 "l" 'forward-char
 "L" 'forward-word
 "a" 'beginning-of-line
 "f" 'end-of-line
 "SPC" leader-map)

(setq modal/normal-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

(general-define-key
 :keymaps 'modal/normal-map
 "q" (lambda() (interactive) (lightning-modal-raise-mode insert))
 "Q" 'edit/insert-beginning-of-line
 "r" 'edit/insert-after
 "R" 'edit/insert-end-of-line
 "e" 'edit/set-region
 "E" 'edit/set-region-line
 "s" 'edit/copy-whole-line
 "S" 'edit/copy-whole-line
 "d" (kbd "C-d")
 "D" 'kill-whole-line
 "w" 'yank
 "W" 'edit/yank-line
 "/" 'swiper
 "u" 'undo-tree-undo
 "U" 'undo-tree-redo
 "n" 'edit/open-line
 "N" (lambda() (interactive) (edit/open-line) (lightning-modal-raise-mode insert))
 "p" 'edit/open-line-above
 "P" (lambda() (interactive) (edit/open-line-above) (lightning-modal-raise-mode insert))
 "g" nil
 "g l" 'isearch-forward
 "g h" 'isearch-backward
 "g c" 'avy-goto-char
 "g l" 'avy-goto-line
 "m" 'edit/insert-mark
 "M" 'edit/goto-mark
 "TAB" 'origami-toggle-node
 "<tab>" 'origami-toggle-node)

(setq modal/region-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

(general-define-key
 :keymaps 'modal/region-map
 "t" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (lightning-modal-raise-mode insert))
 "s" (lambda() (interactive) (copy-region-as-kill (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
 "d" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
 "w" 'edit/yank-region
 "C-g" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
 "M-q" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
 "<escape>" (lambda() (interactive) (pop-mark) (lightning-modal-raise-default-mode))
 "e" 'er/expand-region
 "TAB" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
 "<tab>" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (lightning-modal-raise-default-mode))
 "g" nil
 "g l" 'isearch-forward
 "g h" 'isearch-backward
 ";" 'comment-or-uncomment-region
 "o" nil
 "o (" (lambda() (interactive) (edit/surround-region "(" ")") (lightning-modal-raise-default-mode))
 "o o" (lambda() (interactive) (edit/surround-region (read-from-minibuffer "left: ") (read-from-minibuffer "right: ")) (lightning-modal-raise-default-mode))
 "o )" (lambda() (interactive) (edit/surround-region "(" ")") (lightning-modal-raise-default-mode))
 "o {" (lambda() (interactive) (edit/surround-region "{" "}") (lightning-modal-raise-default-mode))
 "o }" (lambda() (interactive) (edit/surround-region "{" "}") (lightning-modal-raise-default-mode))
 "o [" (lambda() (interactive) (edit/surround-region "[" "]") (lightning-modal-raise-default-mode))
 "o ]" (lambda() (interactive) (edit/surround-region "[" "]") (lightning-modal-raise-default-mode))
 "o \"" (lambda() (interactive) (edit/surround-region "\"" "\"") (lightning-modal-raise-default-mode))
 "o <" (lambda() (interactive) (edit/surround-region "<" ">") (lightning-modal-raise-default-mode))
 "o '" (lambda() (interactive) (edit/surround-region "'" "'") (lightning-modal-raise-default-mode)))

(setq modal/insert-map (make-sparse-keymap))

(general-define-key
 :keymaps 'modal/insert-map
 "C-g" (lambda() (interactive) (lightning-modal-raise-default-mode)))

(general-define-key
 :keymaps 'company-active-map
 "<tab>" 'company-complete
 "TAB" 'company-complete)

(defun set-eshell-custom-map()
  (general-define-key
    :keymaps 'eshell-mode-map
    "C-SPC" leader-map
    "C-@" leader-map))

(add-hook 'eshell-mode-hook 'set-eshell-custom-map)

(require 'dired)
(setq dired-mode-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) dired-mode-map))

(general-define-key
 :keymaps 'dired-mode-map
 "q" (lambda() (interactive) (wdired-change-to-wdired-mode) (lightning-modal-raise-default-mode)))

(setq modal/wdired-normal-map (copy-keymap modal/normal-map))

(general-define-key
 :keymaps 'modal/wdired-normal-map
 "SPC s" (lambda() (interactive) (wdired-finish-edit) (lightning-modal-raise-default-mode)))

(setq modal/org-normal-map (copy-keymap modal/normal-map))

(general-define-key
 :keymaps 'modal/org-normal-map
 "TAB" 'org-cycle
 "<tab>" 'org-cycle)

(general-define-key
 :keymaps 'ivy-minibuffer-map
 "M-j" 'ivy-next-line
 "M-k" 'ivy-previous-line
 "M-RET" 'ivy-immediate-done
 "TAB" 'ivy-partial-or-done
 "RET" 'ivy-done)
