config/config.org
** modal editing implementation using lightning-modal
#+BEGIN_SRC emacs-lisp
  (lightning-modal-ignore-major-mode eshell-mode)
  (lightning-modal-ignore-major-mode dired-mode)
  (lightning-modal-ignore-major-mode ibuffer-mode)

  (lightning-modal-define-mode normal :keymap modal/normal-map :lighter " [N]" :doc "Normal mode"
                      :on-enable (setq cursor-type lightning-user-default-cursor-type))
  (lightning-modal-define-mode insert :keymap modal/insert-map :lighter " [I]" :doc "Insert mode"
                      :on-enable (setq cursor-type 'bar))
  (lightning-modal-define-mode region :keymap modal/region-map :lighter " [R]" :doc "Region mode"
                      :on-enable (setq cursor-type lightning-user-default-cursor-type))
  (lightning-modal-define-mode wdired-normal :keymap modal/wdired-normal-map :lighter " [N]" :doc "Normal mode for wdired"
                      :on-enable (setq cursor-type lightning-user-default-cursor-type))
  (lightning-modal-define-mode org-normal :keymap modal/org-normal-map :lighter " [N]" :doc "Normal mode for org"
                      :on-enable (setq cursor-type lightning-user-default-cursor-type))

  (lightning-modal-set-default-mode normal)
  (lightning-modal-pair-major-mode wdired-mode wdired-normal)
  (lightning-modal-pair-major-mode org-mode org-normal)

  (lightning-modal-global-mode t)
#+END_SRC
* Editing functions
** surround
Functions that surround a region with an opening and closing string
#+BEGIN_SRC emacs-lisp
  (defun edit/surround(start end open close)
    (save-excursion
      (goto-char start)
      (insert open)
      (goto-char (+ end 1))
      (insert close)))

  (defun edit/surround-region(open close)
    (when (region-active-p)
      (edit/surround (region-beginning) (region-end) open close)))
#+END_SRC
** other misc. editing functions
#+BEGIN_SRC emacs-lisp
  (defun edit/insert-after()
    (interactive)
    (forward-char)
    (lightning-modal-raise-mode insert))

  (defun edit/insert-end-of-line()
    (interactive)
    (end-of-line)
    (lightning-modal-raise-mode insert))

  (defun edit/insert-beginning-of-line()
    (interactive)
    (beginning-of-line)
    (lightning-modal-raise-mode insert))

  (defun edit/set-region()
    (interactive)
    (set-mark (point))
    (lightning-modal-raise-mode region))

  (defun edit/set-region-line()
    (interactive)
    (beginning-of-line)
    (set-mark (point))
    (end-of-line)
    (lightning-modal-raise-mode region))

  (defun edit/open-line()
    (interactive)
    (end-of-line)
    (open-line 1)
    (next-line))

  (defun edit/open-line-above()
    (interactive)
    (beginning-of-line)
    (open-line 1))

  (defun edit/yank-line()
    (interactive)
    (save-excursion
      (edit/open-line)
      (yank)
      (delete-blank-lines)))

  (defun edit/kill-whole-word()
    (interactive)
    (backward-char)
    (forward-word)
    (backward-kill-word 1))

  (defun edit/copy-whole-line()
    (interactive)
    (save-excursion
      (kill-whole-line)
      (yank)))

  (defun edit/yank-region()
    (interactive)
    (kill-region (region-beginning) (region-end))
    (yank 2)
    (lightning-modal-raise-default-mode))

  (defun edit/insert-mark()
    (interactive)
    (insert "<++>"))

  (defun edit/goto-mark()
    (interactive)
    (search-forward "<++>")
    (search-backward "<")
    (delete-char  4)
    (lightning-modal-raise-mode insert))
#+END_SRC
* Misc. functions
** macro-make-functions
Evaluates a elmacro generated defun
#+BEGIN_SRC emacs-lisp
  (defun macro-make-function(&optional name)
    (interactive)
    (if (called-interactively-p 'any)
        (setq name (read-string "Macro name: "))
      (setq name (if name name "last-macro")))
    (setq function-string (pp-to-string (elmacro-make-defun (make-symbol (concat "macros/" name)) (elmacro-extract-last-macro elmacro-command-history))))
    (message function-string)
    (set-buffer (generate-new-buffer "*temporaryMacroBuffer*"))
    (erase-buffer)
    (insert function-string)
    (eval-buffer)
    (message function-string)
    (kill-buffer "*temporaryMacroBuffer*"))
#+END_SRC
* Eshell
** eshell/get-last-eshell-buffer
Returns the most recently used eshell buffer
#+BEGIN_SRC emacs-lisp
  (defun eshell/get-last-eshell-buffer()
    (catch 'buffer
      (dolist (buffer (buffer-list))
        (when (cl-search "*eshell*" (buffer-name buffer))
          (throw 'buffer buffer)))))
#+END_SRC
** eshell/switch-to-last-eshell-buffer
Switches to most recent eshell buffer or creates a new one
#+BEGIN_SRC emacs-lisp
  (defun eshell/switch-to-last-eshell-buffer()
    (let ((buffer (eshell/get-last-eshell-buffer)))
      (if buffer
          (switch-to-buffer buffer)
        (eshell))))
#+END_SRC
** eshell/toggle
Switches to eshell if the current buffer isn't an eshell buffer, else returns to previous buffer
#+BEGIN_SRC emacs-lisp
  (defun eshell/toggle()
    (interactive)
    (if (cl-search "*eshell" (buffer-name))
        (switch-to-prev-buffer)
      (eshell/switch-to-last-eshell-buffer)))
#+END_SRC
** eshell-new
Creates a new numbered eshell buffer
#+BEGIN_SRC emacs-lisp
  (setq eshell/new-count 1)
  (defun eshell/new()
    (interactive)
    (eshell eshell/new-count)
    (setq eshell/new-count (+ 1 eshell/new-count)))
#+END_SRC
** eshell-clear
#+BEGIN_SRC emacs-lisp
  (defun eshell/clear ()
    (interactive)
    "Clear the eshell buffer."
    (let ((inhibit-read-only t))
      (erase-buffer)
      (eshell-send-input)))
#+END_SRC
** misc.
Disable linum mode in eshell
#+BEGIN_SRC emacs-lisp
  (add-hook 'eshell-mode-hook (lambda() (interactive) (linum-mode 0)))
#+END_SRC
* Theme
** all-the-icons
#+BEGIN_SRC emacs-lisp
  (lightning-pkg all-the-icons :require t)
  (lightning-pkg all-the-icons-dired :require t)
#+END_SRC
** headerline
#+BEGIN_SRC emacs-lisp
  (setq-default header-line-format '(" %b"))
#+END_SRC
** modeline
#+BEGIN_SRC emacs-lisp
  (setq-default mode-line-format '(" %l : %c : %i"))
#+END_SRC
** theme for tty, where gui is unavailable
#+BEGIN_SRC emacs-lisp
  (defun theme/tty()
    (set-face-attribute 'company-tooltip nil
            :background "#FFFFFF"))
#+END_SRC
** theme for gui
#+BEGIN_SRC emacs-lisp
  (defun theme/gui()
    (setq font-name (or
          (catch 'font-name
            (dolist (font '("Cascadia Mono" "Consolas"))
              (when (find-font (font-spec :name font))
                (throw 'font-name font)))) "monospace"))

    (set-face-attribute 'default nil
                        :family font-name
                        :height 112)
    (set-face-attribute 'linum nil
                        :height 'unspecified
                        :inherit 'default))
#+END_SRC
** general theme customizations
#+BEGIN_SRC emacs-lisp
  (defun theme/general()
    (set-face-attribute 'header-line nil
                        :foreground (face-attribute 'linum :foreground)
                        :background (face-attribute 'default :background)
                        :height (- (face-attribute 'default :height) 5)
                        :inherit nil)

    (set-face-attribute 'header-line-highlight nil
                        :foreground (face-attribute 'header-line :foreground)
                        :background (face-attribute 'header-line :background)
                        :height (face-attribute 'header-line :height)
                        :inherit nil)

    )
#+END_SRC
** reload theme
#+BEGIN_SRC emacs-lisp
  (defun theme/reload()
    (interactive)
    (if (and (display-graphic-p) (not (daemonp)))
        (theme/gui)
      (theme/tty))
    (theme/general))

  (advice-add 'load-theme :after (lambda(&rest args) (theme/reload)))
#+END_SRC
** initialize theme
#+BEGIN_SRC emacs-lisp
  (load-theme 'arc-dark)
#+END_SRC
